## Plan Result (sds_ptl - TerraformPlanApply)




<pre><code>Plan: 7 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-ARCHIVING-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-ARCHIVING-TEST&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-HUB-PROD-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-HUB-SBOX-INTSVC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-SOC-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;HMCTS-SOC-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;Reform-CFT-VH-Dev&#34;]
* Update
  * azurerm_user_assigned_identity.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.monitoring_reader["DTS-ARCHIVING-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "99309157-39e2-4de2-a17b-d407db15cec2"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-ARCHIVING-TEST"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fd6e5281-058b-490f-8c90-186c7f057502"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-HUB-PROD-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "92515ab5-7d61-45f1-9db0-a419e72a0d0b"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-HUB-SBOX-INTSVC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3e1c4905-21f5-47c8-9562-402001ada9b4"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-SOC-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "648f0570-28bd-4b0c-887d-85e6f91d7db8"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["HMCTS-SOC-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fb742e1c-0516-4435-b344-c0589315704c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["Reform-CFT-VH-Dev"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "94c5c7b6-0fe8-4a0a-9903-c36beea533f8"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.this will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "this" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sds-alerts-slack-ptl"
        name                = "sds-alerts-slack-ptl"
      ~ tags                = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":35,"Program":"tfcmt","SHA1":"","Target":"sds_ptl - TerraformPlanApply","Vars":{}} -->